Oussamaelfahsiaccount/Bare-Metal-App/STM32_arm7ve.h
#ifndef STM32_ARM7VE_H_
#define STM32_ARM7VE7_H_

// AHB1
#define PRIPH_BASE             	 	 (0x40000000UL)
#define AHB1PRIPH_OFFSET    		 (0x00020000UL)
#define AHB1PRIPH_BASE       		 (PRIPH_BASE + AHB1PRIPH_OFFSET)

// APB1
#define APB1_OFFSET                  (0x00000000UL)
#define APB1_BASE 					 (PRIPH_BASE + APB1_OFFSET )

//APB2
#define APB2_OFFSET					(0x00010000UL)
#define APB2_BASE  					(PRIPH_BASE + APB2_OFFSET )

//USART 1
#define USART1_OFFSET 			   (0x00011000UL)
#define USART1_BASE				   (APB2_BASE + USART1_OFFSET )

//USART 2
#define USART2_OFFSET 			   (0x00004400UL)
#define USART2_BASE				   ( APB1_BASE + USART2_OFFSET )

//USART 3
#define USART3_OFFSET 			   (0x00004800UL)
#define USART3_BASE				   ( APB1_BASE + USART3_OFFSET )

//USART 4
#define USART4_OFFSET 			   (0x00004C00UL)
#define USART4_BASE				   ( APB1_BASE + USART4_OFFSET )

//USART 5
#define USART5_OFFSET 			   (0x00005000UL)
#define USART5_BASE				   ( APB1_BASE + USART5_OFFSET )
//USART 6
#define USART6_OFFSET              (0x00001400UL)
#define USART6_BASE				   (APB2_BASE + USART6_OFFSET )
//USART 7
#define USART7_OFFSET 			   (0x00007800UL)
#define USART7_BASE				   ( APB1_BASE + USART7_OFFSET )
//USART 8
#define USART8_OFFSET 			   (0x00007C00UL)
#define USART8_BASE				   ( APB1_BASE + USART8_OFFSET )

//GPIO A
#define GPIOA_OFFSET				 (0x00000000UL)
#define GPIOA_R_BASE 				 (AHB1PRIPH_BASE  + GPIOA_OFFSET)

//GPIO B
#define GPIOB_OFFSET				 (0x00000400UL)
#define GPIOB_R_BASE 				 (AHB1PRIPH_BASE  + GPIOB_OFFSET)

//GPIO C
#define GPIOC_OFFSET				 (0x00000800UL)
#define GPIOC_R_BASE 				 (AHB1PRIPH_BASE  + GPIOC_OFFSET)

//GPIO D
#define GPIOD_OFFSET        		 (0x00000C00UL)
#define GPIOD_R_BASE 	             (AHB1PRIPH_BASE + GPIOD_OFFSET )

//GPIO E
#define GPIOE_OFFSET				 (0x00001000UL)
#define GPIOE_R_BASE 				 (AHB1PRIPH_BASE  + GPIOE_OFFSET)

//GPIO F
#define GPIOF_OFFSET				 (0x00001400UL)
#define GPIOF_R_BASE 				 (AHB1PRIPH_BASE  + GPIOF_OFFSET)

//GPIO G
#define GPIOG_OFFSET				 (0x00001800UL)
#define GPIOG_R_BASE 				 (AHB1PRIPH_BASE  + GPIOG_OFFSET)

//GPIO H
#define GPIOH_OFFSET        		 (0x00001C00UL)
#define GPIOH_R_BASE 	             (AHB1PRIPH_BASE + GPIOH_OFFSET )

//GPIO I
#define GPIOI_OFFSET				 (0x00002000UL)
#define GPIOI_R_BASE 				 (AHB1PRIPH_BASE  + GPIOI_OFFSET)

//GPIO J
#define GPIOJ_OFFSET				 (0x00002400UL)
#define GPIOJ_R_BASE 				 (AHB1PRIPH_BASE  + GPIOJ_OFFSET)

//GPIO K
#define GPIOK_OFFSET				 (0x00002800UL)
#define GPIOK_R_BASE 				 (AHB1PRIPH_BASE  + GPIOK_OFFSET)



// RCC
#define RCC_OFFSET			    	 (0x00003800UL)
#define RCC_R_BASE          		 (PRIPH_BASE + RCC_OFFSET )



#endif /* STM32_ARM7VE_H_ */
